In [103]:
#importing pandas and numpy
import pandas as pd
import numpy as np

In [104]:
data = pd.read_csv(r'C:\Users\hp\Downloads\inventory.csv')
data.tail()

   location  product_type         product_description  quantity  price
24   Queens  garden tools                 wheelbarrow        98  89.99
25   Queens  garden tools                       spade        26  19.99
26   Queens  pest_control               insect killer         0  12.99
27   Queens  pest_control                 weed killer        16  23.99
28   Queens       planter  20 inch terracotta planter        87  17.99

In [105]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   location             29 non-null     object
 1   product_type         29 non-null     object
 2   product_description  29 non-null     object
 3   quantity             29 non-null     int64
 4   price                29 non-null     float64
dtypes: float64(1), int64(1), object(3)
memory usage: 1.3+ KB

In [106]:
data.describe()

        quantity      price
count  29.000000  29.000000
mean   40.758621  23.024483
std    35.183859  23.810986
min     0.000000   3.990000
25%     5.000000  12.990000
50%    36.000000  17.990000
75%    76.000000  19.990000
max    98.000000  89.990000

1. what products are sold at your Staten Island location?

In [107]:
data[data['location']=='Staten Island'].product_description

0                         daisy
1                    calla lily
2                        tomato
3                          rake
4                   wheelbarrow
5                         spade
6                 insect killer
7                   weed killer
8    20 inch terracotta planter
9        8 inch plastic planter
Name: product_description, dtype: object

2. Products sold at brooklyn

In [108]:
data[data.location=='Brooklyn'].product_description.unique()

array(['daisy', 'calla lily', 'tomato', 'rake', 'wheelbarrow', 'spade',
       'insect killer', 'weed killer', '20 inch terracotta planter',
       '8 inch plastic planter'], dtype=object)

3. Add a column called in_stock which is True if quantity is greater than 0 and False if quantity equals 0.

In [109]:
data['in_stock'] = data.quantity.apply(lambda x : True if x>0 else False)

In [110]:
data.head()

        location  product_type product_description  quantity  price  in_stock
0  Staten Island         seeds               daisy         4   6.99      True
1  Staten Island         seeds          calla lily        46  19.99      True
2  Staten Island         seeds              tomato        85  13.99      True
3  Staten Island  garden tools                rake         4  13.99      True
4  Staten Island  garden tools         wheelbarrow         0  89.99     False

4. Create a column called  total_value that is equal to price multiplied by quantity.

In [111]:
data['total_value']= data.apply(lambda row: row['quantity']*row['price'], axis= 1)
data.head()

,location,product_type,product_description,quantity,price,in_stock,total_value
0,Staten Island,seeds,daisy,4,6.99,True,27.96
1,Staten Island,seeds,calla lily,46,19.99,True,919.54
2,Staten Island,seeds,tomato,85,13.99,True,1189.15
3,Staten Island,garden tools,rake,4,13.99,True,55.96
4,Staten Island,garden tools,wheelbarrow,0,89.99,False,0.00

5. create a new column called  full_description that has the complete description of each product. ( product type and product description)

In [112]:
data['full_description']= data.apply(lambda x: x['product_type']+' and '+x['product_description'], axis= 1)
data.head()

,location,product_type,product_description,quantity,price,in_stock,total_value,full_description
0,Staten Island,seeds,daisy,4,6.99,True,27.96,seeds and daisy
1,Staten Island,seeds,calla lily,46,19.99,True,919.54,seeds and calla lily
2,Staten Island,seeds,tomato,85,13.99,True,1189.15,seeds and tomato
3,Staten Island,garden tools,rake,4,13.99,True,55.96,garden tools and rake
4,Staten Island,garden tools,wheelbarrow,0,89.99,False,0.00,garden tools and wheelbarrow

In [113]:
!jt -r

Reset css and font defaults in:
C:\Users\hp\.jupyter\custom &
C:\Users\hp\AppData\Roaming\jupyter\nbextensions